SOAMDS/target/classes/apps/HumanResources/HcmIntegrationServices/WSDLs/v1/HcmSubmiFlowSyncProcess.wsdl

<?xml version= '1.0' encoding= 'UTF-8' ?>
<wsdl:definitions
     name="HcmSubmiFlowSyncProcess"
     targetNamespace="http://xmlns.oracle.com/HCMExtractUCMGetFile/HcmGetSubmitFlow/HcmSubmiFlowSyncProcess"
     xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
     xmlns:client="http://xmlns.oracle.com/HCMExtractUCMGetFile/HcmGetSubmitFlow/HcmSubmiFlowSyncProcess"
     xmlns:ns1="http://xmlns.oracle.com/apps/hcm/processFlows/core/flowActionsService/types/"
     xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype"
     xmlns:ns2="http://schemas.oracle.com/bpel/extension"
    >
    <plnk:partnerLinkType name="HcmSubmiFlowSyncProcess">
        <plnk:role name="HcmSubmiFlowSyncProcessProvider" portType="client:HcmSubmiFlowSyncProcess"/>
    </plnk:partnerLinkType>
    <wsdl:import namespace="http://schemas.oracle.com/bpel/extension" location="RuntimeFault.wsdl"/>
    <wsdl:types>
        <schema xmlns="http://www.w3.org/2001/XMLSchema">
            <import namespace="http://xmlns.oracle.com/apps/hcm/processFlows/core/flowActionsService/types/"
                 schemaLocation="oramds:/apps/HumanResources/HcmIntegrationServices/Schemas/v1/FlowActionsService.xsd"/>
        </schema>
    </wsdl:types>
    <wsdl:message name="HcmSubmiFlowSyncProcessRequestMessage">
        <wsdl:part name="payload" element="ns1:submitFlow"/>
    </wsdl:message>
    <wsdl:message name="HcmSubmiFlowSyncProcessResponseMessage">
        <wsdl:part name="payload" element="ns1:submitFlowResponse"/>
    </wsdl:message>
    <wsdl:portType name="HcmSubmiFlowSyncProcess">
        <wsdl:operation name="process">
            <wsdl:input message="client:HcmSubmiFlowSyncProcessRequestMessage"/>
            <wsdl:output message="client:HcmSubmiFlowSyncProcessResponseMessage"/>
        </wsdl:operation>
    </wsdl:portType>
</wsdl:definitions>